In [1]:
#File in laptop to python
import pandas as pd
import os

os.chdir(r"C:\Users\sucha\OneDrive\Desktop\TXST\Semester 1\QMST5336-Analytics\Group Projects\MainFile")
df_full = pd.read_csv("HistoricalProductDemand.csv")

display(df_full.head())
print(df_full.shape)

   Product_Code Warehouse Product_Category       Date Order_Demand
0  Product_0993    Whse_J     Category_028  2012/7/27         100
1  Product_0979    Whse_J     Category_028  2012/1/19         500
2  Product_0979    Whse_J     Category_028   2012/2/3         500
3  Product_0979    Whse_J     Category_028   2012/2/9         500
4  Product_0979    Whse_J     Category_028   2012/3/2         500

(1048575, 5)

In [2]:
#check if there are any null values
df_full.isnull().sum()

Product_Code            0
Warehouse               0
Product_Category        0
Date                11239
Order_Demand            0
dtype: int64

In [3]:
#Drop missing values 
df_full.dropna(inplace=True)
#check again to see if there are any null values
df_full.isnull().sum()

Product_Code        0
Warehouse           0
Product_Category    0
Date                0
Order_Demand        0
dtype: int64

In [4]:
print(df_full.shape)
#A total of 11,239 records will be deleted

(1037336, 5)

In [6]:
df_full.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1037336 entries, 0 to 1048574
Data columns (total 5 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   Product_Code      1037336 non-null  object
 1   Warehouse         1037336 non-null  object
 2   Product_Category  1037336 non-null  object
 3   Date              1037336 non-null  object
 4   Order_Demand      1037336 non-null  object
dtypes: object(5)
memory usage: 47.5+ MB

In [9]:
df_full.describe()

        Product_Code Warehouse Product_Category       Date Order_Demand
count        1037336   1037336          1037336    1037336      1037336
unique          2160         4               33       1729         3749
top     Product_1359    Whse_J     Category_019  2013/9/27        1000
freq           16936    764447           470266       2075       112263

In [10]:
# sort the data according yo date column
df_full.sort_values('Date', ignore_index=True, inplace=True)
df_full.head()

   Product_Code Warehouse Product_Category        Date Order_Demand
0  Product_0965    Whse_A     Category_006    2011/1/8           2
1  Product_0412    Whse_S     Category_007  2011/10/20          (2)
2  Product_0125    Whse_S     Category_011  2011/10/20          (2)
3  Product_0642    Whse_C     Category_019  2011/10/31           3
4  Product_2137    Whse_S     Category_009  2011/11/18         (25)

In [11]:
# there are parenthesis in the OrderDemand column, also it is of string datatype
df_full['Order_Demand'] = df_full['Order_Demand'].str.replace('(',"")
df_full['Order_Demand'] = df_full['Order_Demand'].str.replace(')',"")

# change the dtype as int64
df_full['Order_Demand'] = df_full['Order_Demand'].astype('int64')
df_full.head()

C:\Users\sucha\AppData\Local\Temp\ipykernel_32504\1857939289.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_full['Order_Demand'] = df_full['Order_Demand'].str.replace('(',"")
C:\Users\sucha\AppData\Local\Temp\ipykernel_32504\1857939289.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_full['Order_Demand'] = df_full['Order_Demand'].str.replace(')',"")

   Product_Code Warehouse Product_Category        Date  Order_Demand
0  Product_0965    Whse_A     Category_006    2011/1/8             2
1  Product_0412    Whse_S     Category_007  2011/10/20             2
2  Product_0125    Whse_S     Category_011  2011/10/20             2
3  Product_0642    Whse_C     Category_019  2011/10/31             3
4  Product_2137    Whse_S     Category_009  2011/11/18            25

In [22]:
#Casting all the data in 'Date' field into Datetime Format
import pandas as pd

df_full['Date'] = pd.to_datetime(df_full['Date'])
df_full['Date'].head()

0   2011-01-08
1   2011-10-20
2   2011-10-20
3   2011-10-31
4   2011-11-18
Name: Date, dtype: datetime64[ns]

In [23]:
df_full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1037336 entries, 0 to 1037335
Data columns (total 5 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   Product_Code      1037336 non-null  object
 1   Warehouse         1037336 non-null  object
 2   Product_Category  1037336 non-null  object
 3   Date              1037336 non-null  datetime64[ns]
 4   Order_Demand      1037336 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 39.6+ MB

In [24]:
# categorical variables info
df_full[["Product_Code", "Warehouse", "Product_Category"]].describe()

        Product_Code Warehouse Product_Category
count        1037336   1037336          1037336
unique          2160         4               33
top     Product_1359    Whse_J     Category_019
freq           16936    764447           470266

In [25]:
df_p1359 = df_full.query('Product_Code == "Product_1359"' )

In [26]:
df_p1359.head()

     Product_Code Warehouse Product_Category       Date  Order_Demand
683  Product_1359    Whse_J     Category_019 2012-01-10          1000
698  Product_1359    Whse_J     Category_019 2012-01-10         40000
737  Product_1359    Whse_J     Category_019 2012-01-10          1000
771  Product_1359    Whse_J     Category_019 2012-01-10         25000
772  Product_1359    Whse_J     Category_019 2012-01-10         50000

In [27]:
df_p1359.shape

(16936, 5)

In [28]:
# sort the data according to date column
df_p1359_s = df_p1359.sort_values('Date', ignore_index=True)
#sorted and filtered on product_1359
df_p1359_s.head()

   Product_Code Warehouse Product_Category       Date  Order_Demand
0  Product_1359    Whse_J     Category_019 2012-01-05         16000
1  Product_1359    Whse_J     Category_019 2012-01-05        150000
2  Product_1359    Whse_J     Category_019 2012-01-05        300000
3  Product_1359    Whse_J     Category_019 2012-01-05          2000
4  Product_1359    Whse_J     Category_019 2012-01-05          5000

In [29]:
import numpy as np

In [30]:
#Finding Start date
dd_start = np.datetime64(min(df_p1359_s.Date.unique()),'D')
dd_start

numpy.datetime64('2012-01-05')

In [31]:
#Finding end date
dd_end = np.datetime64(max(df_p1359_s.Date.unique()),'D')
dd_end

numpy.datetime64('2017-01-06')